#### Terraform Plan
```
Acquiring state lock. This may take a few moments...
module.apis.google_project_service.run: Refreshing state... [id=lumios-490217/run.googleapis.com]
module.apis.google_project_service.monitoring: Refreshing state... [id=lumios-490217/monitoring.googleapis.com]
module.apis.google_project_service.secretmanager: Refreshing state... [id=lumios-490217/secretmanager.googleapis.com]
module.apis.google_project_service.cloudtrace: Refreshing state... [id=lumios-490217/cloudtrace.googleapis.com]
module.apis.google_project_service.compute: Refreshing state... [id=lumios-490217/compute.googleapis.com]
module.apis.google_project_service.iam: Refreshing state... [id=lumios-490217/iam.googleapis.com]
module.apis.google_project_service.artifactregistry: Refreshing state... [id=lumios-490217/artifactregistry.googleapis.com]
module.apis.google_project_service.cloudscheduler: Refreshing state... [id=lumios-490217/cloudscheduler.googleapis.com]
module.apis.google_project_service.cloudresourcemanager: Refreshing state... [id=lumios-490217/cloudresourcemanager.googleapis.com]
module.storage.google_storage_bucket.photos: Refreshing state... [id=lumios-photos-lumios-490217]
module.secrets.random_password.secret_key: Refreshing state... [id=none]
module.secrets.google_secret_manager_secret.google_frontend_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-frontend-client-id]
module.secrets.google_secret_manager_secret.init_admin_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-init-admin-password]
module.secrets.google_secret_manager_secret.secret_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-secret-key]
module.secrets.random_password.postgres: Refreshing state... [id=none]
module.secrets.google_secret_manager_secret.google_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-id]
module.secrets.random_password.jwt_secret: Refreshing state... [id=none]
module.secrets.google_secret_manager_secret.google_client_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-secret]
module.secrets.google_secret_manager_secret.brevo_api_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-brevo-api-key]
module.artifact_registry.google_artifact_registry_repository.lumios: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/repositories/lumios]
module.secrets.google_secret_manager_secret.postgres_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-postgres-password]
module.network.google_compute_network.lumios: Refreshing state... [id=projects/lumios-490217/global/networks/lumios]
module.secrets.google_secret_manager_secret.jwt_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-jwt-secret]
module.secrets.random_password.init_admin_password: Refreshing state... [id=none]
module.secrets.google_secret_manager_secret_version.postgres_password: Refreshing state... [id=projects/714378756224/secrets/lumios-postgres-password/versions/1]
module.secrets.google_secret_manager_secret_version.secret_key: Refreshing state... [id=projects/714378756224/secrets/lumios-secret-key/versions/1]
module.secrets.google_secret_manager_secret_version.jwt_secret: Refreshing state... [id=projects/714378756224/secrets/lumios-jwt-secret/versions/1]
module.secrets.google_secret_manager_secret_version.init_admin_password: Refreshing state... [id=projects/714378756224/secrets/lumios-init-admin-password/versions/1]
module.network.google_compute_subnetwork.lumios: Refreshing state... [id=projects/lumios-490217/regions/europe-west1/subnetworks/lumios-europe-west1]
module.vm.google_service_account.vm: Refreshing state... [id=projects/lumios-490217/serviceAccounts/lumios-vm@lumios-490217.iam.gserviceaccount.com]
module.vm.google_compute_firewall.allow_iap_ssh: Refreshing state... [id=projects/lumios-490217/global/firewalls/lumios-allow-iap-ssh]
module.vm.google_compute_firewall.allow_db: Refreshing state... [id=projects/lumios-490217/global/firewalls/lumios-allow-db-internal]
module.vm.google_compute_disk.data: Refreshing state... [id=projects/lumios-490217/zones/europe-west1-b/disks/lumios-data]
module.vm.google_secret_manager_secret_iam_member.vm_postgres_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-postgres-password/roles/secretmanager.secretAccessor/serviceAccount:lumios-vm@lumios-490217.iam.gserviceaccount.com]
module.vm.google_compute_instance.vm: Refreshing state... [id=projects/lumios-490217/zones/europe-west1-b/instances/lumios-vm]
module.cloudrun.google_service_account.cloudrun: Refreshing state... [id=projects/lumios-490217/serviceAccounts/lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_service_account.cloudrun_frontend: Refreshing state... [id=projects/lumios-490217/serviceAccounts/lumios-cloudrun-frontend@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret.gcs_hmac_access_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-access-key]
module.cloudrun.data.google_client_openid_userinfo.terraform: Reading...
module.cloudrun.google_service_account.cloudrun_landingpage: Refreshing state... [id=projects/lumios-490217/serviceAccounts/lumios-cloudrun-landingpage@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret.gcs_hmac_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-secret]
module.cloudrun.data.google_client_openid_userinfo.terraform: Read complete after 0s [id=terraform@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_jwt_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-jwt-secret/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_google_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-id/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_brevo_api_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-brevo-api-key/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_storage_bucket_iam_member.cloudrun_photos: Refreshing state... [id=b/lumios-photos-lumios-490217/roles/storage.objectAdmin/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_secret_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-secret-key/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_google_frontend_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-frontend-client-id/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_gcs_hmac_access_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-access-key/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_init_admin_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-init-admin-password/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_postgres_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-postgres-password/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_google_client_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-secret/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_project_iam_member.cloudrun_trace_agent: Refreshing state... [id=lumios-490217/roles/cloudtrace.agent/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_cloud_run_v2_service.landingpage: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-landingpage]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_gcs_hmac_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-secret/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_cloud_run_v2_service.frontend: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-frontend]
module.cloudrun.google_cloud_run_v2_service.backend: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-backend]
module.cloudrun.google_cloud_run_v2_service_iam_member.landingpage_public: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-landingpage/roles/run.invoker/allUsers]
module.cloudrun.google_cloud_run_domain_mapping.landingpage: Refreshing state... [id=locations/europe-west1/namespaces/lumios-490217/domainmappings/lumios.niecke-it.de]
module.cloudrun.google_cloud_run_v2_service_iam_member.frontend_public: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-frontend/roles/run.invoker/allUsers]
module.cloudrun.google_cloud_run_domain_mapping.frontend: Refreshing state... [id=locations/europe-west1/namespaces/lumios-490217/domainmappings/lumios-app.niecke-it.de]
module.cloudrun.google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-backend/roles/run.invoker/allUsers]
module.cloudrun.google_cloud_run_domain_mapping.backend: Refreshing state... [id=locations/europe-west1/namespaces/lumios-490217/domainmappings/lumios-api.niecke-it.de]
module.cleanup.google_service_account.cleanup_job: Refreshing state... [id=projects/lumios-490217/serviceAccounts/lumios-cleanup-job@lumios-490217.iam.gserviceaccount.com]
module.monitoring.google_monitoring_notification_channel.email: Refreshing state... [id=projects/lumios-490217/notificationChannels/11538723110999998090]
module.cleanup.google_service_account.cleanup_scheduler: Refreshing state... [id=projects/lumios-490217/serviceAccounts/lumios-cleanup-scheduler@lumios-490217.iam.gserviceaccount.com]
module.cleanup.google_storage_bucket_iam_member.cleanup_photos: Refreshing state... [id=b/lumios-photos-lumios-490217/roles/storage.objectAdmin/serviceAccount:lumios-cleanup-job@lumios-490217.iam.gserviceaccount.com]
module.cleanup.google_secret_manager_secret_iam_member.cleanup_postgres_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-postgres-password/roles/secretmanager.secretAccessor/serviceAccount:lumios-cleanup-job@lumios-490217.iam.gserviceaccount.com]
module.cleanup.google_secret_manager_secret_iam_member.cleanup_gcs_hmac_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-secret/roles/secretmanager.secretAccessor/serviceAccount:lumios-cleanup-job@lumios-490217.iam.gserviceaccount.com]
module.cleanup.google_secret_manager_secret_iam_member.cleanup_secret_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-secret-key/roles/secretmanager.secretAccessor/serviceAccount:lumios-cleanup-job@lumios-490217.iam.gserviceaccount.com]
module.cleanup.google_secret_manager_secret_iam_member.cleanup_gcs_hmac_access_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-access-key/roles/secretmanager.secretAccessor/serviceAccount:lumios-cleanup-job@lumios-490217.iam.gserviceaccount.com]
module.cleanup.google_secret_manager_secret_iam_member.cleanup_jwt_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-jwt-secret/roles/secretmanager.secretAccessor/serviceAccount:lumios-cleanup-job@lumios-490217.iam.gserviceaccount.com]
module.cleanup.google_cloud_run_v2_job.cleanup: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/jobs/lumios-cleanup]
module.cleanup.google_cloud_run_v2_job_iam_member.scheduler_invoker: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/jobs/lumios-cleanup/roles/run.invoker/serviceAccount:lumios-cleanup-scheduler@lumios-490217.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cleanup.google_cloud_run_v2_job.audit_cleanup will be created
  + resource "google_cloud_run_v2_job" "audit_cleanup" {
      + conditions               = (known after apply)
      + create_time              = (known after apply)
      + creator                  = (known after apply)
      + delete_time              = (known after apply)
      + deletion_protection      = true
      + effective_annotations    = (known after apply)
      + effective_labels         = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                     = (known after apply)
      + execution_count          = (known after apply)
      + expire_time              = (known after apply)
      + generation               = (known after apply)
      + id                       = (known after apply)
      + last_modifier            = (known after apply)
      + latest_created_execution = (known after apply)
      + launch_stage             = (known after apply)
      + location                 = "europe-west1"
      + name                     = "lumios-audit-cleanup"
      + observed_generation      = (known after apply)
      + project                  = "lumios-490217"
      + reconciling              = (known after apply)
      + terminal_condition       = (known after apply)
      + terraform_labels         = {
          + "goog-terraform-provisioned" = "true"
        }
      + uid                      = (known after apply)
      + update_time              = (known after apply)

      + template {
          + parallelism = (known after apply)
          + task_count  = (known after apply)

          + template {
              + execution_environment = (known after apply)
              + max_retries           = 3
              + service_account       = "lumios-cleanup-job@lumios-490217.iam.gserviceaccount.com"
              + timeout               = (known after apply)

              + containers {
                  + command = [
                      + "python",
                      + "-m",
                      + "flask",
                      + "purge-audit-logs",
                    ]
                  + image   = "europe-west1-docker.pkg.dev/lumios-490217/lumios/backend:latest"

                  + env {
                      + name  = "GOOGLE_CLOUD_PROJECT"
                      + value = "lumios-490217"
                    }
                  + env {
                      + name  = "JWT_SECRET"
                        # (1 unchanged attribute hidden)

                      + value_source {
                          + secret_key_ref {
                              + secret  = "lumios-jwt-secret"
                              + version = "latest"
                            }
                        }
                    }
                  + env {
                      + name  = "POSTGRES_DB"
                      + value = "lumios"
                    }
                  + env {
                      + name  = "POSTGRES_HOST"
                      + value = "10.0.0.3"
                    }
                  + env {
                      + name  = "POSTGRES_PASSWORD"
                        # (1 unchanged attribute hidden)

                      + value_source {
                          + secret_key_ref {
                              + secret  = "lumios-postgres-password"
                              + version = "latest"
                            }
                        }
                    }
                  + env {
                      + name  = "POSTGRES_USER"
                      + value = "lumios"
                    }
                  + env {
                      + name  = "SECRET_KEY"
                        # (1 unchanged attribute hidden)

                      + value_source {
                          + secret_key_ref {
                              + secret  = "lumios-secret-key"
                              + version = "latest"
                            }
                        }
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }

                  + startup_probe (known after apply)
                }

              + vpc_access {
                  + egress = "PRIVATE_RANGES_ONLY"

                  + network_interfaces {
                      + network    = "projects/lumios-490217/global/networks/lumios"
                      + subnetwork = "projects/lumios-490217/regions/europe-west1/subnetworks/lumios-europe-west1"
                    }
                }
            }
        }
    }

  # module.cleanup.google_cloud_run_v2_job_iam_member.scheduler_audit_invoker will be created
  + resource "google_cloud_run_v2_job_iam_member" "scheduler_audit_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "serviceAccount:lumios-cleanup-scheduler@lumios-490217.iam.gserviceaccount.com"
      + name     = "lumios-audit-cleanup"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
    }

  # module.cleanup.google_cloud_scheduler_job.audit_cleanup_daily will be created
  + resource "google_cloud_scheduler_job" "audit_cleanup_daily" {
      + attempt_deadline = "320s"
      + description      = "Purge audit log entries older than 90 days at 03:00 UTC"
      + id               = (known after apply)
      + name             = "lumios-audit-cleanup-daily"
      + paused           = (known after apply)
      + project          = "lumios-490217"
      + region           = "europe-west1"
      + schedule         = "0 3 * * *"
      + state            = (known after apply)
      + time_zone        = "UTC"

      + http_target {
          + http_method = "POST"
          + uri         = "https://europe-west1-run.googleapis.com/apis/run.googleapis.com/v1/namespaces/lumios-490217/jobs/lumios-audit-cleanup:run"

          + oauth_token {
              + service_account_email = "lumios-cleanup-scheduler@lumios-490217.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 3
        }
    }

  # module.cleanup.google_cloud_scheduler_job.cleanup_daily will be created
  + resource "google_cloud_scheduler_job" "cleanup_daily" {
      + attempt_deadline = "320s"
      + description      = "Trigger the Lumios cleanup Cloud Run Job at 02:00 UTC"
      + id               = (known after apply)
      + name             = "lumios-cleanup-daily"
      + paused           = (known after apply)
      + project          = "lumios-490217"
      + region           = "europe-west1"
      + schedule         = "0 2 * * *"
      + state            = (known after apply)
      + time_zone        = "UTC"

      + http_target {
          + http_method = "POST"
          + uri         = "https://europe-west1-run.googleapis.com/apis/run.googleapis.com/v1/namespaces/lumios-490217/jobs/lumios-cleanup:run"

          + oauth_token {
              + service_account_email = "lumios-cleanup-scheduler@lumios-490217.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 3
        }
    }

  # module.cloudrun.google_cloud_run_v2_service.backend will be updated in-place
  ~ resource "google_cloud_run_v2_service" "backend" {
      - client                  = "gcloud" -> null
      - client_version          = "561.0.0" -> null
        id                      = "projects/lumios-490217/locations/europe-west1/services/lumios-backend"
        name                    = "lumios-backend"
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cloudrun.google_cloud_run_v2_service.frontend will be updated in-place
  ~ resource "google_cloud_run_v2_service" "frontend" {
      - client                  = "gcloud" -> null
      - client_version          = "561.0.0" -> null
        id                      = "projects/lumios-490217/locations/europe-west1/services/lumios-frontend"
        name                    = "lumios-frontend"
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```